---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCExtrusionBasis.BasisX
enum: Autodesk.Revit.DB.IFC.IFCExtrusionBasis
source: html/19e272ae-693c-a2aa-31f1-0c5e442b8ba0.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionBasis.BasisX

The X direction.